In [4]:
import pandas as pd
import numpy as np


string_data = pd.Series(['aardvark', 'artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna() #返回所有非空数据以及索引值

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1.,6.5, 3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
cleaned = data.dropna()#默认删除有na的行

In [13]:
print(data)
print(cleaned)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0
     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how = 'all') #删除所有值都为NaN的行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA #插入一列，为4，所有值都为NAN
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(axis = 'columns', how = 'all') #删除所有行都为NaN的列

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [29]:
df = pd.DataFrame(np.random.randn(7,3))

In [31]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.407430       NaN       NaN
1 -0.258627       NaN       NaN
2  1.309985       NaN -0.466864
3  1.014230       NaN -1.111761
4  0.778273  0.150450  0.455852
5  0.419152 -1.184335 -1.013137
6 -1.628117  0.699590  0.155125

In [32]:
df.dropna()

          0         1         2
4  0.778273  0.150450  0.455852
5  0.419152 -1.184335 -1.013137
6 -1.628117  0.699590  0.155125

In [64]:
df.dropna(thresh = 2, axis = 0) #thresh代表的是如果该行（列）的有效数据如果小于这个数，就删除该行(列)

          0         1         2
2  1.309985       NaN -0.466864
3  1.014230       NaN -1.111761
4  0.778273  0.150450  0.455852
5  0.419152 -1.184335 -1.013137
6 -1.628117  0.699590  0.155125

In [67]:
print(df)
df.fillna({1:0.5,2:0}) #对应的第一列设定值为0.5，第二列为0

          0         1         2
0  1.407430       NaN       NaN
1 -0.258627       NaN       NaN
2  1.309985       NaN -0.466864
3  1.014230       NaN -1.111761
4  0.778273  0.150450  0.455852
5  0.419152 -1.184335 -1.013137
6 -1.628117  0.699590  0.155125

          0         1         2
0  1.407430  0.500000  0.000000
1 -0.258627  0.500000  0.000000
2  1.309985  0.500000 -0.466864
3  1.014230  0.500000 -1.111761
4  0.778273  0.150450  0.455852
5  0.419152 -1.184335 -1.013137
6 -1.628117  0.699590  0.155125

In [76]:
df.fillna(0, inplace = True) #_  inplace修改的是已存在的对象 
df

          0         1         2
0 -1.313201  0.205506  0.693901
1  0.481708  0.072403 -0.198379
2  0.623584  0.000000 -1.571664
3 -0.036919  0.000000  0.901000
4 -0.221594  0.000000  0.000000
5  0.847130  0.000000  0.000000

In [73]:
df = pd.DataFrame(np.random.randn(6,3))
print(df)
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
print(df)
print(df.fillna(method = 'ffill', limit = 2)) #填补的是跟上面同样的数据

          0         1         2
0 -1.313201  0.205506  0.693901
1  0.481708  0.072403 -0.198379
2  0.623584 -0.179599 -1.571664
3 -0.036919 -0.085575  0.901000
4 -0.221594 -2.656714  1.212126
5  0.847130 -0.020943  1.067763
          0         1         2
0 -1.313201  0.205506  0.693901
1  0.481708  0.072403 -0.198379
2  0.623584       NaN -1.571664
3 -0.036919       NaN  0.901000
4 -0.221594       NaN       NaN
5  0.847130       NaN       NaN
          0         1         2
0 -1.313201  0.205506  0.693901
1  0.481708  0.072403 -0.198379
2  0.623584  0.072403 -1.571664
3 -0.036919  0.072403  0.901000
4 -0.221594       NaN  0.901000
5  0.847130       NaN  0.901000

In [74]:
data = pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [78]:
# 7.2.1 删除重复行

data = pd.DataFrame({'k1': ['one','two']*3 +['two'], 'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [80]:
data.duplicated() #检查每一行是否重复

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [81]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [83]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [84]:
data.drop_duplicates(['k1']) #把k1列后面重复的选项全部删除

    k1  k2  v1
0  one   1   0
1  two   1   1

In [96]:
data.drop_duplicates(['k1','k2'], keep ='last') #保留重复数据中的最后一个，默认的时候是第一个

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [105]:
data = pd.DataFrame({'food': ['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham', 'nova lox'], 'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [108]:
meat_to_animal = {'bacon':'pig','pastrami': 'cow','honey ham': 'pig', 'nova lox':'salmon','pulled pork': 'pig','corned beef': 'cow'}

In [109]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [110]:
data['animal'] = lowercased.map(meat_to_animal) #找映射关系
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [111]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [112]:
data = pd.Series([1., -999., 2., -999.,-1000., 3.]) # -999可能是缺失值的标志
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [116]:
import numpy as np

data.replace(-999, np.nan) #替换值

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [117]:
#一次性替换多值
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [118]:
# 将不同的值替换成不同值
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [120]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [122]:
data = pd.DataFrame(np.arange(12).reshape(3,4), index = ['Ohio','Colorado','New York'], columns = ['one', 'two', 'three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11